tszydzik/nRF52/nRF52_DK_test/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
#ifdef NUS_TEST
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids)
            / sizeof(m_adv_uuids[0]);

    scanrsp.uuids_complete.p_uuids = m_adv_uuids;
#endif
    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout = APP_ADV_TIMEOUT_IN_SECONDS;
#ifdef NUS_TEST
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt,
            NULL);
#else
    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt,
             NULL);

#endif
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds) {
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
            APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void) {
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static testErr_t test_stopSoftDevice() {
    testErr_t err_code = NRF_SUCCESS;

    return err_code;
}

static testErr_t test_startAdvertising(advEndCond_t endCondition){
    testErr_t err_code = NRF_SUCCESS;
    // TODO Initialize for non connectable


    // TODO start advertising

    // TODO Wait for timeout scan received or timeout condition
    if(endCondition ==  endOnScanReq){
//        if(bleAdvState != )
//        err_code = 11;

    }else{



    }

    return err_code;
}


static void test_startSoftDevice(ble_enable_params_t* ble_enable_params){
     testErr_t err_code;
     // Enable BLE stack.

     err_code = softdevice_enable(ble_enable_params);
     APP_ERROR_CHECK(err_code);

//     Subscribe for BLE events.
     err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
     APP_ERROR_CHECK(err_code);

     // Register with the SoftDevice handler module for BLE events.
   //  err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
     APP_ERROR_CHECK(err_code);

}

static void test_initialize(ble_enable_params_t *ble_enable_params) {
    testErr_t err_code;

    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize SoftDevice.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
    PERIPHERAL_LINK_COUNT, ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);
    APP_ERROR_CHECK(err_code);

    return err_code;

}

#ifdef TEST_TUT5
void test_tut5ble(void){
    testErr_t err_code = 0 ;

    ble_gap_addr_t gap_address;
    gap_address.addr_type = BLE_GAP_ADDR_TYPE_RANDOM_STATIC; //BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE;
    //err_code = sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_AUTO, &gap_address); //TODO where can i set this addres
    sd_ble_gap_addr_set(&gap_address);
}


void test_tut5_gap_params_init(void){
    uint32_t                err_code;

    // Declearing parameter structs. Try to go to the struct definitions to get
    // more information about what parameters they contain
    ble_gap_conn_params_t   gap_conn_params;    // Struct to store GAP connection parameters like max min connection interval etc
    ble_gap_conn_sec_mode_t sec_mode;           // Struct to store security parameters

    // A simple macro that sets the Security Mode and Level bits in sec_mode
    // to require no protection (open link)
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    // Store the device name and security mode in the SoftDevice. Our name is defined to "HelloWorld" in the beginning of this file
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code); // Check for errors

    // Always initialize all fields in structs to zero or you might get unexpected behaviour
    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    // Populate the GAP connection parameter struct
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    // Set GAP Peripheral Preferred Connection Parameters
    // The device use these prefered values when negotiating connection terms with another device
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    // Set appearence
    sd_ble_gap_appearance_set(0);
    APP_ERROR_CHECK(err_code);// Check for errors

}

void test_tut5_advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

    ble_advdata_manuf_data_t        manuf_data; // Variable to hold manufacturer specific data
    uint8_t data[]                      = "HW_TEST"; // Our data to adverise
    manuf_data.company_identifier       = 0x0059; // Nordics company ID
    manuf_data.data.p_data              = data;
    manuf_data.data.size                = sizeof(data);


