tszydzik/nRF52/nRF52_DK_test/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));

    //advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.name_type = BLE_ADVDATA_SHORT_NAME; // Use a shortened name
    advdata.short_name_len = 4;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.p_manuf_specific_data = &manuf_data;
    int8_t tx_powerlelve = -13;
    advdata.p_tx_power_level =  &tx_powerlelve;
    advdata.include_appearance = true;
    sd_ble_gap_appearance_set(BLE_APPEARANCE_HID_MOUSE);

    // Prepare the scan response Manufacturer specific data packet
        ble_advdata_manuf_data_t                manuf_data_response;
        uint8_t                                 data_response[] = "Many_bytes_of_data"; // Remember there is a 0 terminator at the end of string
        manuf_data_response.company_identifier       = 0x0059;
        manuf_data_response.data.p_data              = data_response;
        manuf_data_response.data.size                = sizeof(data_response);

        ble_advdata_t   advdata_response;// Declare and populate a scan response packet

        // Always initialize all fields in structs to zero or you might get unexpected behaviour
        memset(&advdata_response, 0, sizeof(advdata_response));
        // Populate the scan response packet
        advdata_response.name_type               = BLE_ADVDATA_NO_NAME;
        advdata_response.p_manuf_specific_data   = &manuf_data_response;



    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &advdata_response, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);

   // ble_gap_adv_params_t
}


void test_tut5_conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

void test_tut5main(){

    testErr_t err_code;

    test_tut5_gap_params_init();
    test_tut5_advertising_init();
    test_tut5_conn_params_init();

    // Start execution.
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);


    APP_ERROR_CHECK(err_code);
}

#endif
/**@brief Application main function.
 */
int main(void) {
    testErr_t err_code;
    bool erase_bonds;

    ble_enable_params_t ble_enable_params;

    test_initialize(&ble_enable_params);

    uart_init();

    buttons_leds_init(&erase_bonds);

    /*
   //  ble_stack_init();
     gap_params_init();
     services_init();
     advertising_init();
     conn_params_init();

     err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
     APP_ERROR_CHECK(err_code);*/


    //est_ble_stack_init(&ble_enable_params); already done in test_init
    test_startSoftDevice(&ble_enable_params);

    test_tut5main();
/*
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
    */

    printf("\r\nUART Start!\r\n");
    // Enter main loop.
    for (;;) {
        power_manage();
    }

}

/**
 * @}
 */
